app/views/users/show.html.erb

SELECT "events".* FROM "events" INNER JOIN "attendances" ON "events"."id" = "attendances"."event_id" WHERE "attendances"."user_id" = $1  [["user_id", 31]]
---
			  <tbody>
			  	<% @user.events.each do |event| %>