app/views/events/index.html.erb


<% Event.all.order(start_date: :asc).each do |event| %>
---
SELECT "events".* FROM "events" ORDER BY "events"."start_date" ASC