app/views/events/show.html.erb

SELECT COUNT(*) FROM "users" INNER JOIN "attendances" ON "users"."id" = "attendances"."user_id" WHERE "attendances"."event_id" = $1  [["event_id", 16]]
---
  <strong class="text-warning">Prix : </strong>       <%=@event.price%> €<br/>
        Inscrit(s) : <%=@event.users.count%><br/>